; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	spectrograph4 - mode
	image3 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	image0 - mode
	GroundStation6 - direction
	Star5 - direction
	Star4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 image0)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star1)
	(supports instrument5 image3)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument6 image0)
	(supports instrument6 image3)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 image3)
	(supports instrument7 image0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 Star1)
	(supports instrument8 image3)
	(supports instrument8 image0)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(pointing satellite2 GroundStation6)
	(have_image Star7 spectrograph2)
	(have_image Planet8 spectrograph2)
	(have_image Star9 spectrograph4)
	(have_image Planet10 image0)
	(have_image Star11 spectrograph2)
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 spectrograph2)
	(have_image Planet14 image3)
))

)

; plan
1. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 9
2. (calibrate satellite2 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 0 of 9
3. (turn_to satellite2 planet14 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet14)
   goals met: 0 of 9
4. (take_image satellite2 planet14 instrument7 image3)
   added: (have_image planet14 image3)
   goals met: 1 of 9
5. (turn_to satellite2 planet10 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet10)
   goals met: 1 of 9
6. (turn_to satellite1 groundstation3 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 9
7. (take_image satellite2 planet10 instrument7 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 9
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 9
9. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 2 of 9
10. (turn_to satellite1 phenomenon13 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
11. (take_image satellite1 phenomenon13 instrument3 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 3 of 9
12. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 3 of 9
13. (take_image satellite1 planet12 instrument3 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 4 of 9
14. (turn_to satellite1 planet8 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet8)
   goals met: 4 of 9
15. (take_image satellite1 planet8 instrument3 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 5 of 9
16. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 5 of 9
17. (take_image satellite1 star11 instrument3 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 6 of 9
18. (turn_to satellite1 star7 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star7)
   goals met: 6 of 9
19. (take_image satellite1 star7 instrument3 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 7 of 9
20. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 7 of 9
21. (take_image satellite1 star9 instrument3 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 9
22. (turn_to satellite2 groundstation6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 groundstation6)
   goals met: 9 of 9
